package com.example.testmasha;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.view.View;
import android.widget.Button;
import android.widget.TextView;
import android.widget.Toast;

import java.util.ArrayList;

public class MainActivity extends AppCompatActivity implements View.OnClickListener {
    ArrayList<Test>  questions;
    TextView quest, answer1,answer2,answer3,answer4;
    String writeAnwer;

    int count;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        quest=findViewById(R.id.textviewQust);
        answer1=findViewById(R.id.textviewanswer1);
        answer2=findViewById(R.id.textviewanswer2);
        answer3=findViewById(R.id.textviewanswer3);
        answer4=findViewById(R.id.textviewanswer4);

        WritingNo one=new WritingNo("Частку НЕ потрібно писати разом з наступним словом у рядку","не/покоїтися про сина","ще не/завершена справа","не/крутити носом","досі не/прочитана книжка");
        WritingNo two=new WritingNo("Частку НЕ потрібно писати разом з наступним словом у рядку","не/здужати задачу","не/довиконувати план","не/досконалий твір","не/сила терпіти");
        WritingNo three=new WritingNo("Частку НЕ потрібно писати разом з наступним словом у рядку","сказав дуже не/впевнено; давно не/здужає","писав не/думаючи; розгулялася не/года","зупинився не/випадково; ріка не/глибока","ужити не/гайних заходів; не/треба чекати");
        WritingNo fore=new WritingNo("Частку НЕ потрібно писати разом з наступним словом у рядку","надійти не/помітно; не/покоїтися про мене","зробити не/обіцяючи; літати не/високо","трапилося не/щастя; не/можна заздрити","не/заважай працювати; не/зоране поле");
        WritingNo five=new WritingNo("Частку НЕ потрібно писати разом з наступним словом у реченні","Глухий, що не/дочуює, то вигадає.","Не/доведи, щоб розум задрімав.","Не/доженеш конем, що запізниш одним днем.","Печаль виховує мене, не/дорікає.");
        WritingNo six=new WritingNo("Частку НЕ потрібно писати окремо з наступним словом у реченні","Де багато кухарів, там собаки не/голодні.","Затужилося так в не/босводі.","Не/зв'язаний сніп - солома.","Лихий кухар або не/досолить, або пересолить.");
        WritingNo seven=new WritingNo("Частку НЕ потрібно писати окремо з наступним словом у реченні","Соловей піснями не/ситий.","Поспішно, та не/доладно.","На вовка не/слава, а їсть овець Сава.","Хоч мороз і прикіпає, зате комарів не/має");
        WritingNo eight=new WritingNo("Допущено помилку на правопис частки НЕ в рядку","Тоді ще не знав я, що все проходить, все губиться в не впинній зміні подій.","Я люблю тебе, друже, за те, що не можу тебе не любити.","Коли-не-коли заходив до житників, щоб не дуже набридати.","Ми не лукавили з тобою, ми просто йшли, у нас нема зерна неправди за собою.");
        WritingNo nine=new WritingNo("Частку НЕ потрібно писати окремо з наступним словом у реченні","У польоті, ніким не.бачені, я спрямовую кораблі.","Хай падають із неба зорі, немов не/зібране зерно.","І довгий рікчекають марно рядки не/читаних книжок.","Не/полоханий спокій над Києвом сонним дріма.");
        WritingNo ten=new WritingNo("НЕ вживаються без НЕ всі слова рядка","небавом, небога, негідницький","ненавидіти, небуття, невдаха","нездара, нетерплячка, нещастя","негода, неуважність, немовля");
        Apostrof eleven = new Apostrof("Апостроф треба писати в усіх словах рядка","ум..ятина, знечі..я, харків..янин","мр..яка, між..їздівський, реп..ях","кам..яний, м..ясницф, горохв..яний","сум..яття, недокрів..я, р..ябенький");
        Apostrof twelve = new Apostrof("Апостроф треба писати в усіх словах рядка","бур..янець, без..язикий, об..ємний","пред..явник, пів..Європи, пів..яйця","В..ячеслав, Св..ятослав, Валер..ян","в..йокати, Лук..яніка, напівм..який");
        Apostrof thirteen = new Apostrof("Апостроф треба писати в усіх словах рядка","в..юнитись, зап..ятсний, арф..р","Примор..я, подвір..я, пор..ядок","Р..єпін, прем..єр, солом..яний","кар..єра, трав..яний, кр..якати");
        Apostrof fourteen = new Apostrof("Апостроф треба писати в усіх словах рядка","міжгір..я, голуб..я, зв..язковий","мор..як, поголів..я, полум..яний","подзв..якувати, п..яльця, верф..ю","краков..як, міл..ярд, об..їздити");
        Apostrof fifteen = new Apostrof("Апостроф треба писати в усіх словах рядка","Стеф..юк, Лук..янчук, Солов..яненко","вітр..як, в..єтнамець, стерв..ятник","бур..ячиння, крем..яний, прив..ялий","в..язи, св..ятилище, сухом..ятка");
        Apostrof sixteen= new Apostrof("Апостроф треба писати в усіх словах рядка","роз..ївся, хлоп..ятко, пів..ящика","дріб..язковий, гр..ядка, любов..ю","тр..юк, преджнив..яний, узгір..я","темр..ява, валер..янка, Прип..ять");
        Apostrof seventeen= new Apostrof("Апостроф треба писати в усіх словах рядка","різнотрав..я, пуп..янок, луб..яний","дез..активація, гороб..ята, кров..ю","безправ..я, без..іменний, п..янковий","череп..я, обр..ядовість, зіп..ястись");
        Apostrof eighteen=new Apostrof("Апостроф треба писати в усіх словах рядка","від..ємний, заозер..я, під..ярок","роз..юшити, в..юн, гр..юкати","кип..ятити, гар..ячий, пам..ять","зав..язка, під..язиковий, бур..я");
        Apostrof nineteen= new Apostrof("Апостроф треба писати в усіх словах рядка","з..ясувати, олов..яний, реп..ях","вп..ятьох, цв..яшок, бур..янище","багатослів..я, р..ядовий, плем..я","бар..єр, плоскогір..я, бр..язкати");
        Apostrof twenty= new Apostrof("Апостроф треба писати в усіх словах рядка","підгір..я, перемир..я, різнобарв..я","Мар..янівка, п..ятдесят, кур..ятина","брукв..яний, м..якшити, м..ясний","плоскостоп..я, помор..янин, дуб..я");
        Miakyznak twenty1 = new Miakyznak("М'який знак на місці пропуску треба писати в усіх словах рядка","вуз..кий, б'єт..ся, бад..орість, нян..чин","біл..ше, Гуцул..щина, київс..кий, піс..ня","л..отчик, їдал..ня, взірец.., Уман..щина","Пол..ща, л..вівський, низ..кий, мен..ше");
        Miakyznak twenty2 = new Miakyznak("М'який знак на місці пропуску треба писати в усіх словах рядка","винос..те, поділ..ський, заволз..кий","волен..ці, камін..чик, навчаєт..ся","карпатс..кий, слиз..кий, матусен..ці","ошукан..ство, сяд..те, мадярс..кий");
        Miakyznak twenty3 = new Miakyznak("М'який знак на місці пропуску треба писати в усіх словах рядка","піднос..ся, виріз..блений, людс..кість","щиріс..ть, ковал..ський, війс..ковий","розріс..ся, слов'янс..кий, брин..чати","дитин..ці, товарис..кий, кишен..ці");
        Miakyznak twenty4 = new Miakyznak("М'який знак на місці пропуску треба писати в усіх словах рядка","нян..чин, рибон..ці, кружал..це","іранс..кий, сторонон..ці, мудрец..","промін..ці, чотир..ох, Вас..ці","облич.., тюр..ма, друкарен..");
        Miakyznak twenty5 = new Miakyznak("М'який знак на місці пропуску треба писати в усіх словах рядка","піт..ма, хвац..куватий, зган..бити","гордіст.., консул..ський, річен..ці","корін..чик, виход..те, купал..ський","русал..чин, погод..ся, лял..чин");
        Miakyznak twenty6 = new Miakyznak("М'який знак на місці пропуску НЕ ТРЕБА писати в усіх словах рядка","Тет..яна, календар.., громадян..ський","передач.., трудівниц.., Вернад..ський","Ґдан..ськ, поділ..ський, карбован..цем","барабан..щик, Ковал..ський, колис..ці");
        Miakyznak twenty7 = new Miakyznak("М'який знак на місці пропуску НЕ ТРЕБА писати в усіх словах рядка","сип..те, тон..ший, корис..тю","шануєш.., пан..щина, глянец..","колос..ся, любов.., памороз..","поліс..кий, мрієш.., пас..мо");
        Miakyznak twenty8 = new Miakyznak("М'який знак на місці пропуску НЕ ТРЕБА писати в усіх словах рядка","сімдесят.., колодяз..ник, кобзар..","безсил..ля, постав..те, борот..бист","порад..те, склепін..частий, Сибір..","ниточ..ці, повіл..но, славет..ність");
        Miakyznak twenty9 = new Miakyznak("М'який знак на місці пропуску НЕ ТРЕБА писати в усіх словах рядка","Ул..яна, промін..чик, тварин..ці","бояз..кий, ковз..кий, різ..бяр","Луган..щина, угорс..кий, мас..ці","млин..ці, галуз..ці, брин..чати");
        Miakyznak thirty = new Miakyznak("М'який знак на місці пропуску НЕ ТРЕБА писати в усіх словах рядка","селян..ський, п'ят..сот, чотир..ма","жмен..ці, стеблин..ці, ялинон..ці","мен..ший, біл..ший, павутин..ці","матін..чин, волин..ський, їдал..ня");
        OEU thirty1 = new OEU("Літеру И на місці пропуску треба писати в усіх словах рядка","пал..чка, в..сочина, кош..чок","д..плом, створ..ння, вогн..ще","м..лькати, гл..бінь, скр..піти","кр..шити, семююро, х..мерний");
        OEU thirty2 = new OEU("Літеру И на місці пропуску треба писати в усіх словах рядка","промов..стий, сх..лития, тр..мати","пр..звісько, вр..ватися, зб..регти","виховат..ль, сел..ще, тр..валий","к..рпатий, т..рплячий, розх..тати");
        OEU thirty3 = new OEU("Літеру И на місці пропуску треба писати в усіх словах рядка","бл..скавці, одгр..міти, муз..ка","печ..ніги, кр..тичний, заруч..ни","хр..зантема, велос..пед, с..режки","конт..нент, гор..зонт, п..рукар");
        OEU thirty4 = new OEU("Літеру E на місці пропуску треба писати в усіх словах рядка","кл..котіти, заб..ру, ст..жина","зам..сти, мороз..во, пош..пки","шел..стіти, г..рой, глиб..на","б..региня, скр..готати, л..мон");
        OEU thirty5 = new OEU("Літеру E на місці пропуску треба писати в усіх словах рядка","ал..горія, скл..піння, ш..ренга, дон..чка","вул..чка, оч..рет, ч..мпіон, юр..сдикція","ф..стиваль, гр..чаний, плет..во, в..чоріти","зам..рехтіти, гус..ниця, л..вада, т..раж");
        OEU thirty6 = new OEU("Літеру E на місці пропуску треба писати в усіх словах рядка","д..шевий, лот..рея, ст..блина, щ..бетання","щ..дрівка, вел..чезний, вист..лити, ч..пурний","сут..нки, в..рещати, кол..скова, в..рболіз","в..черя, кр..тичний, благоч..стивий, м..даль");
        OEU thirty7 = new OEU("Літеру O на місці пропуску треба писати в усіх словах рядка","к..тушка, ак..рдеон, ..таман","п..ром, марк..фаг, трансп..рант","к..нфорка, пат..логія, к..шалот","ф..нікулер, ді..рама, п..ролон");
        OEU thirty8 = new OEU("Літеру O на місці пропуску треба писати в усіх словах рядка","б..рсук, кр..хмаль, м..настир","пар..бук, г..нчар, оп..лонка","к..зак, марм..ровий, з..зуля","к..лосся, вор..шити, д..ріжка");
        OEU thirty9 = new OEU("Літеру O на місці пропуску треба писати в усіх словах рядка","с..кира, кр..пива, п..ртрет","ябл..ко, г..лубиний, л..пата","т..вар, к..миш, марм..р","к..жух, п..ріг, б..гатир");
        OEU fourty = new OEU("Правильно написано всі слова рядка","калач, допомога, гонити","отаман, горячий, ламати","солдат, богато, паганий","ганяти, багач, допомогати");
        Prefix fourty1 = new Prefix("Літеру З на місці пропуску треба писати в усіх словах рядка","бе..силий, ро..копати, бе..крилий","ро..повісти, ..цементувати, ..пекти ","..ховати, ..керуваати, ро..чистити","ро..кроїти, ..підлоба, бе..прав'я");
        Prefix fourty2 = new Prefix("Літеру З на місці пропуску треба писати в усіх словах рядка","бе..барвний, ..молочений, ..жувати","..тягнення, ..вернутися, ро..почати","ро..писка, ..поживати, ро..клад","..бивати, ро..писати, ..корочення");
        Prefix fourty3 = new Prefix("Префікс ЗІ є в кожному слові рядка","..зв'янути, ..йтися, ..стрибнути","..тнутися, ..грітися, ..кроїти","..рвати, ..старитися, ..тримати","..щулитися, ..псувати, ..клеїти");
        Prefix fourty4 = new Prefix("Літеру С на місці крапок треба писати в кожному слові рядка","..касувати, не..проста, ..стискач","..ховванка, ..чеплення, ..тиха","..тратити, ..прожогу, ..жати","..шиток, ..прямувати, ..терти");
        Prefix fourty5 = new Prefix("Літеру С на місці крапок треба писати в кожному слові рядка","..фабрикувати, ..тяжка, ..пуск","..чесати, ..кинути, ..цілення","..тишити, ..терпіти, ..чинити","..сунути, ..палахнути, ..хил");
        Prefix fourty6 = new Prefix("Літеру Е на місці крапок треба писати в кожному слові рядка","пр..освященний, пр..мудрість, пр..чистий","пр..бережний, пр..щедрий, пр..вражий","пр..голубити, пр..завзятий, пр..кумедний","пр..вільний, пр..святий, пр..земкуватий");
        Prefix fourty7 = new Prefix("Літеру Е на місці крапок треба писати в кожному слові рядка","пр..великий, пр..непорочний, пр..стол","пр..старий, пр..багато, пр..кінцевий","пр..білений, пр..чудовий, пр..довгий","пр..велебний, пр..дорожній, пр..тихий");
        Prefix fourty8= new Prefix("Літеру И на місці крапок треба писати в кожному слові рядка","пр..вабити, пр..голомшити, пр..бутки"," пр..жовкати, пр..міський, пр..мужній","пр..марнілий, пр..купити, пр..мокрий","пр..морожений, пр..сідати, пр..грубий");
        Prefix fourty9 = new Prefix("Літеру И на місці крапок треба писати в кожному слові рядка","пр..мружити, пр..гірклий, пр..боркувати","пр..ходити, пр..єднати, пр..зирливий","пр..будова, пр..кордонний,пр..звище","пр..подобний, пр..шитий, пр..співувати");
        Prefix fifty = new Prefix("Помилку в правописі префікса допущено в рядку","обшукати, безслідно, зфальшивити","надхмарний, оббити, розплющити","міжсудинний, передплата, відчинити","зіпсувати, безтурботний, обпекти");
        questions= new ArrayList<>();
        questions.add(one);
        questions.add(two);
        questions.add(three);
        questions.add(fore);
        questions.add(five);
        questions.add(six);
        questions.add(seven);
        questions.add(eight);
        questions.add(nine);
        questions.add(ten);
        questions.add(eleven);
        questions.add(twelve);
        questions.add(thirteen);
        questions.add(fourteen);
        questions.add(fifteen);
        questions.add(sixteen);
        questions.add(seventeen);
        questions.add(eighteen);
        questions.add(nineteen);
        questions.add(twenty);
        questions.add(twenty1);
        questions.add(twenty2);
        questions.add(twenty3);
        questions.add(twenty4);
        questions.add(twenty5);
        questions.add(twenty6);
        questions.add(twenty7);
        questions.add(twenty8);
        questions.add(twenty9);
        questions.add(thirty);
        questions.add(thirty1);
        questions.add(thirty2);
        questions.add(thirty3);
        questions.add(thirty4);
        questions.add(thirty5);
        questions.add(thirty6);
        questions.add(thirty7);
        questions.add(thirty8);
        questions.add(thirty9);
        questions.add(fourty);
        questions.add(fourty1);
        questions.add(fourty2);
        questions.add(fourty3);
        questions.add(fourty4);
        questions.add(fourty5);
        questions.add(fourty6);
        questions.add(fourty7);
        questions.add(fourty8);
        questions.add(fourty9);
        questions.add(fifty);
        count=0;
        Bundle bundle=getIntent().getExtras();
        int start=bundle.getInt("Start");
        int qunt=bundle.getInt("Quntity");

        nextqust();
        answer1.setOnClickListener(this);
        answer2.setOnClickListener(this);
        answer3.setOnClickListener(this);
        answer4.setOnClickListener(this);
    }

    public void nextqust() {
        quest.setText(((WritingNo)questions.get(count)).getQuestion());
        writeAnwer=((WritingNo)questions.get(count)).getRightanswer();
        int check=(int)(Math.random()*4);
        switch (check){
            case 0:
                answer1.setText(((WritingNo)questions.get(count)).getRightanswer());
        answer2.setText(((WritingNo)questions.get(count)).getWronganserone());
        answer3.setText(((WritingNo)questions.get(count)).getWrongansertwo());
        answer4.setText(((WritingNo)questions.get(count)).getWronganserthree());
        if(count<10){count++;}
        break;

            case 1:

                answer1.setText(((WritingNo)questions.get(count)).getWronganserone());
                answer2.setText(((WritingNo)questions.get(count)).getRightanswer());
                answer3.setText(((WritingNo)questions.get(count)).getWrongansertwo());
                answer4.setText(((WritingNo)questions.get(count)).getWronganserthree());
                if(count<10){count++;}
            break;

        case 2:

            answer1.setText(((WritingNo)questions.get(count)).getWronganserone());
            answer2.setText(((WritingNo)questions.get(count)).getWrongansertwo());
            answer3.setText(((WritingNo)questions.get(count)).getWronganserthree());
            answer4.setText(((WritingNo)questions.get(count)).getRightanswer());
            if(count<10){count++;}
            break;

            case 3:
            answer1.setText(((WritingNo)questions.get(count)).getWronganserone());
            answer2.setText(((WritingNo)questions.get(count)).getWrongansertwo());
            answer3.setText(((WritingNo)questions.get(count)).getRightanswer());
            answer4.setText(((WritingNo)questions.get(count)).getWronganserthree());
            if(count<10){count++;}
        break;}

    }

    @Override
    public void onClick(View v) {

        int id=v.getId();
        switch (id){
            case R.id.textviewanswer1:
                if(answer1.getText().toString()==writeAnwer){

                }
                nextqust();
                break;

        }
        //Toast.makeText(this," "+id,Toast.LENGTH_SHORT).show();


    }
}
